# language: ja
機能: クライアント画像素材アップロード機能
  クライアントは
  プロモーションリングの表示の為に
  管理画面から画像素材をアップロードする。

  シナリオ: 登録した画像素材一覧を見る
    前提 クライアントアカウントでログイン中
    かつ プロモーション詳細画面を表示中
    もし 素材登録タブをクリック
    ならば 登録している画像素材の一覧が表示される
    かつ 画像素材いつに対し、タイトル、画像の大きさ、リンクタグを表示する

  シナリオ: 画像素材の登録画面を表示する
    前提 クライアントアカウントでログイン中
    かつ 画像素材一覧を表示中
    もし 素材新規登録をクリック
    ならば 画像登録フォームが表示される
    かつ アップロードボタンが表示される

  シナリオ: 複数の画像素材をアップロード
    前提 クライアントアカウントでログイン中
    かつ 画像素材登録画面を表示中
    もし ファイルを選択ボタンをクリック
    ならば ファイル選択ダイアログ表示される

    
